CREATE VIEW Замовлення2 AS SELECT DISTINCT [Код товару], [Кількість товару], [Дата замовлення]
FROM Замовлення;


select * from Замовлення2
WHERE [Дата замовлення] = '2020-05-21'


SELECT Товар1.[Код товару], Товар1.[Назва товару], Товар1.Ціна, Замовлення2.[Кількість товару], Замовлення2.[Дата замовлення]
FROM Товар1, Замовлення2
WHERE Товар1.[Код товару] = Замовлення2.[Код товару]


SELECT Товар1.[Код товару], Товар1.[Назва товару], Товар1.Ціна, Замовлення2.[Кількість товару], Замовлення2.[Дата замовлення]
FROM Товар1, Замовлення2
WHERE Товар1.[Код товару] = Замовлення2.[Код товару] AND Товар1.Ціна < 10